# Задача 1. Создать список и заполнить его элементами различных типов данных.

test_list = ['text', 43, 42.4, [2, 3], {45, 'lol'}, (478, 'super text'), True, None]

for count in test_list:
    print(count, type(count))
